[
    {
        "title": "A generalized phase resetting method for phase-locked modes prediction",
        "image_url": "images/PRC.png",
        "summary": "This study introduces an innovative method to predict and analyze phase-locked modes in neural networks, focusing on master-slave systems with dynamic feedback. Expanding on traditional phase resetting, the research incorporates multiple inputs per cycle to better reflect complex neural interactions. The authors provide a recursive approach to calculate phase resetting for these scenarios, validated through numerical simulations. This framework offers new insights into neural synchronization, paving the way for advancements in understanding neural dynamics and their applications in neuroscience.",
        "link": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0174304"
    },
    {
        "title": "Fine-tuned local coordination environment of Pt single atoms on ceria controls catalytic reactivity",
        "image_url": "images/41467_2022_34797_Fig6_HTML.webp",
        "summary": "This groundbreaking study explores how fine-tuning the local coordination environment of platinum (Pt) single atoms on cerium oxide (ceria) significantly enhances their catalytic performance for low-temperature carbon monoxide (CO) oxidation. By precisely adjusting the atomic arrangement around Pt atoms, researchers achieved improved catalytic activity and stability, paving the way for more efficient single-atom catalyst designs. These findings provide valuable insights for advancing catalytic technologies to address environmental challenges.",
        "link": "https://www.nature.com/articles/s41467-022-34797-2"
    },
    {
        "title": "Ligand-Coordinated Pt Single-Atom catalyst facilitates Support-Assisted Water-Gas shift reaction",
        "image_url": "images/Pt_ligand.jpg",
        "summary": "This study explores how interactions between single metal atoms and their support materials affect catalytic performance in carbon monoxide (CO) oxidation. By focusing on single-atom catalysts, the research uncovers critical insights into optimizing these interactions to boost efficiency. These findings pave the way for innovative catalyst designs with enhanced performance for environmental applications.",
        "link": "https://www.sciencedirect.com/science/article/pii/S0021951724004366"
    },
    {
         "title": "Increased Selectivity in Photolytic Activation of Nanoassemblies Compared to Thermal Activation in On-Surface Ullmann Coupling",
         "image_url": "images/Ullmann_Coupling.png",
         "summary": "The study investigates the selectivity of on-surface Ullmann coupling reactions, comparing photolytic (light-induced) activation to traditional thermal activation methods. The research demonstrates that photolytic activation enhances selectivity in forming desired products, offering a more controlled approach to synthesizing complex molecular structures on surfaces. These findings have significant implications for the development of advanced materials and nanostructures, highlighting the potential of light-driven processes in surface chemistry.",
         "link":"https://pubs.acs.org/doi/full/10.1021/acsnano.3c11509"
     }
]
